src/Documents/Событие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Событие</Name>
			<Comment>Предварительная запись клиента</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНапоминанияДоЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиЗаписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеРезерва</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренесённаяПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолисМедСтрахования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолисыМедицинскогоСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаРезерва</Name>
					<Comment>Цвет фона резерва</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакЗаблокированно</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗаписи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныЗаписи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ТипыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПредварительнаяЗапись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВходящееПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Письмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПушУведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мессенджер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыСобытия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПодтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПациентОжидает</Name>
					<Comment>Для предварительной записи более не используется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНачат</Name>
					<Comment>Пациент в кресле</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемОкончен</Name>
					<Comment>Прием окончен</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНеСостоялся</Name>
					<Comment>Для предварительной записи более не используется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемОтменен</Name>
					<Comment>Прием отменен</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Помещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Помещения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтображатьВРасписанииЗанятий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Comment>Цвет фона помещения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/Событие/Forms/ФормаРезерва/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
// Флаг указывающий что это форма нового документа
Перем ЭтоНовыйДок;     

#КонецОбласти     

#Область ОбработчикиСобытийФормы
////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда
		
		Если Объект.СтруктурнаяЕдиница.Пустая() = Истина Тогда
			Объект.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		КонецЕсли;
		
		Если Объект.АвторДокумента.Пустая() = Истина Тогда
			Объект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
	
		Если Объект.ТипСобытия.Пустая() = Истина Тогда
			Объект.ТипСобытия = Перечисления.ТипыСобытий.ПредварительнаяЗапись;
		КонецЕсли;
		
		Если Объект.ВидЦен.Пустая() = Истина Тогда
			Объект.ВидЦен = ?(Не Объект.СтруктурнаяЕдиница.ВидЦенРеализации.Пустая(), Объект.СтруктурнаяЕдиница.ВидЦенРеализации, Справочники.ВидыЦен.Розничная);
		КонецЕсли;
		
		Если Параметры.Свойство("Резерв") Тогда 
			Если Параметры.Резерв Тогда 
				Объект.Резерв = Параметры.Резерв;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ДатаНачала) И ЗначениеЗаполнено(Параметры.ДатаОкончания)  Тогда
			
			НоваяСтрока               = Объект.Услуги.Добавить();
			НоваяСтрока.ДатаНачала    = Параметры.ДатаНачала;
			НоваяСтрока.ДатаОкончания = Параметры.ДатаОкончания;
			НоваяСтрока.НормаВремени  = (Параметры.ДатаОкончания - Параметры.ДатаНачала) / 60;
			НоваяСтрока.Сотрудник 	  = ?(Параметры.Свойство("Сотрудник"), Параметры.Сотрудник, Справочники.Сотрудники.ПустаяСсылка());
			НоваяСтрока.Помещение     = ?(Параметры.Свойство("Помещение"), Параметры.Помещение, Справочники.Помещения.ПустаяСсылка());
			
			ДатаНачала 		= Параметры.ДатаНачала;
			ДатаОкончания 	= Параметры.ДатаОкончания;
			НормаВремени 	= (Параметры.ДатаОкончания - Параметры.ДатаНачала) / 60;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьДаты();
	
	РаботаСДиалогами.УстановитьДоступностьЭлементовФормДокументаПоПравамПользователя(ЭтаФорма, Объект);	
	
	Если Объект.Услуги.Количество() > 0 Тогда
		ДатаСобытия = Объект.Услуги[0].ДатаНачала;
	ИначеЕсли ЗначениеЗаполнено(Параметры.ДатаНачала) Тогда
		ДатаСобытия = Параметры.ДатаНачала;
	Иначе
		ДатаСобытия = ТекущаяДата();		
	КонецЕсли;
		
	// Сохранение вводимых значений
	СохранениеВводимыхЗначений.ЗаполнитьСписокВыбора(ЭтаФорма, ЭлементыДляСохранения(), ЭтаФорма.ИмяФормы);
	Элементы.ОснованиеРезерва.КнопкаВыбора = Ложь;
	
	УстановитьВидимостьЭлементов();
	
	// Отображение информации о дате создания документа
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Элементы.ДекорацияДатаСоздания.Видимость 	= Истина;
		// Элементы.Декорация_Заглушка.Видимость 		= Истина;
		Элементы.ДекорацияДатаСоздания.Заголовок = "Создан: " + Формат(Объект.Дата, "ДФ='дд ММММ ""в"" ЧЧ:мм, '") + Объект.АвторДокумента;
	Иначе
	    Элементы.ДекорацияДатаСоздания.Видимость 	= Ложь;
	//	Элементы.Декорация_Заглушка.Видимость 		= Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриОткрытии.
// В процедуре устанавливается текущая страница в зависимости от операции.
//
Процедура ПриОткрытии(Отказ)
	
	ЭтоНовыйДок = НЕ ЗначениеЗаполнено(Объект.Ссылка);
	
	#Если ВебКлиент Тогда
		ЗапускВэбКлиент = Истина;
	#КонецЕсли	
	
	// МеханизмВнешнегоОборудования
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		// ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:
			|""%ОписаниеОшибки%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	// Конец МеханизмВнешнегоОборудования 
	
	УстановкаЦвета(ЦветФонаРезерваФорма);
	
	// Зададим списки выбора для элементов выбора времени начала и окончания услуг
	// Это вынужденная мера, т.к. в платформе 8.3.4 есть косяк со списками выбора
	ПроинициализироватьЭлементыВыбораВремени();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, 
//
Процедура УстановкаЦвета(ЦветФонаРезерваФорма)
	
	// Установка цвета
	Если ЗначениеЗаполнено(Объект.ЦветФонаРезерва) Тогда
		ЦветФонаРезерваФорма = Объект.ЦветФонаРезерва;
		Элементы.УстановкаЦвет.ЦветФона = ЗначениеИзСтрокиВнутр(Объект.ЦветФонаРезерва);
	ИначеЕсли ЗначениеЗаполнено(ЦветФонаРезерваФорма) Тогда  
		Объект.ЦветФонаРезерва = ЦветФонаРезерваФорма;
		Элементы.УстановкаЦвет.ЦветФона = ЗначениеИзСтрокиВнутр(Объект.ЦветФонаРезерва);
	Иначе 
		Объект.ЦветФонаРезерва = ЗначениеВСтрокуВнутр(WebЦвета.Хаки);
		ЦветФонаРезерваФорма = Объект.ЦветФонаРезерва;
		Элементы.УстановкаЦвет.ЦветФона = WebЦвета.Хаки;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Обработчик события "ПриЗаписиНаСервре"
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Сохранение вводимых значений
	СохранениеВводимыхЗначений.ОбновитьСпискиВыбора(ЭтаФорма, ЭлементыДляСохранения(), ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик команды ПослеЗаписиНаСервере
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПослеЗаписи.
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененоСобытие");
	Если ЭтоНовыйДок Тогда 
	     ОповеститьОЗаписиНового(Объект);
	КонецЕсли;	 
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик события ОбработкаПроверкиЗаполненияНаСервере формы
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка на работу структурной единицы
	Если Объект.Услуги.Количество() > 0 Тогда
		ПериодРаботы = ОбщегоНазначенияСтоматология.ПолучитьВремяРаботыСтруктурнойЕдиницы(Объект.Услуги[0].ДатаНачала, Объект.СтруктурнаяЕдиница); 
		Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
			Если СтрокаТЧ.ДатаОкончания = НачалоДня(СтрокаТЧ.ДатаОкончания) Тогда 
				СтрокаТЧ.ДатаОкончания = СтрокаТЧ.ДатаОкончания - 1;
			КонецЕсли;						
			Если СтрокаТЧ.ДатаНачала < ПериодРаботы.ДатаНачала ИЛИ СтрокаТЧ.ДатаНачала >= ПериодРаботы.ДатаОкончания
				ИЛИ СтрокаТЧ.ДатаОкончания <= ПериодРаботы.ДатаНачала ИЛИ СтрокаТЧ.ДатаОкончания > ПериодРаботы.ДатаОкончания Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строка " + СтрокаТЧ.НомерСтроки + ":Структурная единица не работает " + ПредставлениеПериода(СтрокаТЧ.ДатаНачала, СтрокаТЧ.ДатаОкончания) + "!");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода Дата.
//
Процедура ДатаПриИзменении(Элемент)
	
	Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
		СтрокаТЧ.ДатаНачала = НачалоДня(ДатаСобытия) + (СтрокаТЧ.ДатаНачала - НачалоДня(СтрокаТЧ.ДатаНачала));
		СтрокаТЧ.ДатаОкончания = НачалоДня(ДатаСобытия) + (СтрокаТЧ.ДатаОкончания - НачалоДня(СтрокаТЧ.ДатаОкончания));
	КонецЦикла;
	
КонецПроцедуры // ДатаНачалаПриИзменении()	

&НаСервере
// Процедура устанавливает видимость элементов.
//
Процедура УстановитьВидимостьЭлементов()
	
	Если Объект.Ссылка.Проведен = Истина И (Объект.Ссылка.Статус = Перечисления.СтатусыСобытия.НеПодтверждена ИЛИ Объект.Ссылка.Статус = Перечисления.СтатусыСобытия.Подтверждена) Тогда
		Элементы.ГруппаОтменаРезерва.Видимость = Истина;
	Иначе
		Элементы.ГруппаОтменаРезерва.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
//
//
Процедура УстановитьДаты()
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) И НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда 
		Если Объект.Услуги.Количество() <> 0 Тогда
			ДатаНачала 		= Объект.Услуги[0].ДатаНачала;
			ДатаОкончания 	= Объект.Услуги[0].ДатаОкончания;
			НормаВремени 	= (Объект.Услуги[0].ДатаОкончания - Объект.Услуги[0].ДатаНачала) / 60;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды ОтменитьСобытие
//
Процедура КомандаОтменитьСобытие(Команда)
	
	Если Модифицированность = Истина Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОСохраненииИзменений", ЭтотОбъект), "Событие было модифицировано, перед отменой события все изменения сохраняться.", РежимДиалогаВопрос.ОКОтмена);
        Возврат;
	КонецЕсли;
	
	КомандаОтменитьСобытиеФрагмент(); 
	
КонецПроцедуры

&НаКлиенте
// Процедура - После вопроса о сохранении изменений
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеВопросаОСохраненииИзменений(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		Записать();
	Иначе
		Возврат;
	КонецЕсли;
	
	КомандаОтменитьСобытиеФрагмент();

КонецПроцедуры

&НаКлиенте
// Процедура - Команда отменить событие фрагмент
//
Процедура КомандаОтменитьСобытиеФрагмент()
	
	ОбщегоНазначенияКлиентСтоматология.ОтменитьСобытие(Объект.Ссылка,, Новый ОписаниеОповещения("КомандаОтменитьСобытиеЗавершение", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
// Процедура - Команда отменить событие завершение.
//
Процедура КомандаОтменитьСобытиеЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Истина Тогда
		Оповестить("ИзмененоСобытие");
		Закрыть();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Команда, обработчик установки цвета
//
Процедура ЦветРезерва(Команда)
	
	ДиалогЦвета = Новый ДиалогВыбораЦвета();
	
	#Если Не ВебКлиент Тогда
		ДиалогЦвета.Цвет = Элементы.УстановкаЦвет.ЦветФона;
	#КонецЕсли
	
	ДиалогЦвета.Показать(Новый ОписаниеОповещения("ЦветРезерваЗавершение", ЭтотОбъект));	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Цвет резерва завершение
//
// Параметры:
//  Цвет					 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ЦветРезерваЗавершение(Цвет, ДополнительныеПараметры) Экспорт
	
	Если Цвет <> Неопределено Тогда
		ИзменитьЦветФонаРезерва(Цвет);
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура изменяет устанавливает в значение реквизита - цвет фона.
//
Процедура ИзменитьЦветФонаРезерва(Цвет)
	
	Объект.ЦветФонаРезерва = ЗначениеВСтрокуВнутр(Цвет);
	ЦветФонаРезерваФорма = Объект.ЦветФонаРезерва;
	Элементы.УстановкаЦвет.ЦветФона = Цвет;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении элемента ДатаНачала.
//
Процедура УслугиВремяПриИзменении(Элемент)
	
	ЭтоВремяНачала = Найти(Элемент.Имя, "ДатаНачала") <> 0;
	ИмяРеквизита = ?(ЭтоВремяНачала, "ДатаНачала", "ДатаОкончания");
	
	Если ДатаОкончания <= ДатаНачала Тогда
		ЭтаФорма[ИмяРеквизита] = Дата("00010101");
	КонецЕсли;
	
	Объект.Услуги[0][ИмяРеквизита] = ЭтаФорма[ИмяРеквизита];
	
	Объект.Услуги[0].НормаВремени = (ДатаОкончания - ДатаНачала) / 60;
	НормаВремени = (ДатаОкончания - ДатаНачала) / 60;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении элемента НормаВремени.
//
Процедура УслугиНормаВремениПолемПриИзменении(Элемент)
	
	Объект.Услуги[0].ДатаОкончания = ДатаНачала + НормаВремени * 60;
	ДатаОкончания = ДатаНачала + НормаВремени * 60; 	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события НачалоВыбораИзСписка поля ввода ДатаНачала.
//
Процедура УслугиДатаНачалаПолемНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 	
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(ОбщегоНазначенияСтоматология.ПолучитьВремяРаботыСтруктурнойЕдиницы(ДатаСобытия, Объект.СтруктурнаяЕдиница));
	
	СписокВеремени 		= РаботаСДиалогами.ВернутьСписокВремени(МассивПериодов, Истина);		
	НачальноеЗначение 	= СписокВеремени.НайтиПоЗначению(ДатаНачала);		
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("УслугиДатаНачалаЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), СписокВеремени, Элемент, НачальноеЗначение);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Услуги дата начала полем начало выбора из списка завершение
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура УслугиДатаНачалаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.Услуги[0].ДатаНачала = ВыбранныйЭлемент.Значение;
		ДатаНачала = ВыбранныйЭлемент.Значение;
		ВремяПриИзменении(ДополнительныеПараметры.Элемент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события НачалоВыбораИзСписка поля ДатаОкончания.
//
Процедура УслугиДатаОкончанияПолемНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Счетчик = 0;		
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(ОбщегоНазначенияСтоматология.ПолучитьВремяРаботыСтруктурнойЕдиницы(ДатаСобытия, Объект.СтруктурнаяЕдиница));
	
	СписокВеремени = РаботаСДиалогами.ВернутьСписокВремени(МассивПериодов, Ложь);
	Пока Счетчик = 0 И СписокВеремени.Количество() > 0 И СписокВеремени[Счетчик].Значение < ДатаНачала Цикл
		СписокВеремени.Удалить(Счетчик);
	КонецЦикла;	
	
	НачальноеЗначение 	= СписокВеремени.НайтиПоЗначению(ДатаОкончания);	
	ВыбранноеВремя = Неопределено;
	
	ЭтаФорма.ПоказатьВыборИзСписка(Новый ОписаниеОповещения("УслугиДатаОкончанияЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), СписокВеремени, Элемент, НачальноеЗначение); 	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Услуги дата окончания завершение
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура УслугиДатаОкончанияЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.Услуги[0].ДатаОкончания = ВыбранныйЭлемент.Значение;
		ДатаОкончания = ВыбранныйЭлемент.Значение;
		ВремяПриИзменении(ДополнительныеПараметры.Элемент);
	КонецЕсли;

КонецПроцедуры

 &НаКлиенте
// Процедура - обработчик события ПриИзменении таблицы значений Услуги, элемента Время.
//
Процедура ВремяПриИзменении(Элемент)
	
	Если Объект.Резерв Тогда 
		Объект.Услуги[0].НормаВремени = (ДатаОкончания - ДатаНачала) / 60;
		НормаВремени = (ДатаОкончания - ДатаНачала) / 60;
	Иначе 
		ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;	
		ТекущаяСтрока.НормаВремени = (ТекущаяСтрока.ДатаОкончания - ТекущаяСтрока.ДатаНачала) / 60;
		НормаВремени = (ДатаОкончания - ДатаНачала) / 60;
	КонецЕсли;	
	
КонецПроцедуры

//&НаКлиенте
//// Обработчик открытия формы кэш списка вводимых значений
////
// Процедура Подключаемый_ОбработчикКэшЛист(Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
//	
//	СтандартнаяОбработка = Ложь;
//	Объект.ОснованиеРезерва = СохранениеВводимыхЗначенийКлиент.ОбработчикВызоваФормыРедактированияКэшСписка(Элемент, ЭтаФорма);
//	
// КонецПроцедуры

&НаСервере
// Веренет таблицу сохраняемых элементов
//
Функция ЭлементыДляСохранения()
	
	СохраняемыеЭлементы = Новый Структура("ОснованиеРезерва", Объект.ОснованиеРезерва);
	
	Возврат СохранениеВводимыхЗначений.СформироватьТаблицуСохраненяемыхЭлементов(СохраняемыеЭлементы);
	
КонецФункции

&НаКлиенте
// Устанавливает списки выбора для элементов выбора времени начала и окончания услуг
// Это вынужденная мера, т.к. в платформе 8.3.4 есть косяк со списками выбора
//
Процедура ПроинициализироватьЭлементыВыбораВремени()

	МассивИнициализируемыхЭлементов = Новый Массив;
	МассивИнициализируемыхЭлементов.Добавить("УслугиДатаНачалаПолем");
	МассивИнициализируемыхЭлементов.Добавить("УслугиДатаОкончанияПолем");
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(ОбщегоНазначенияСтоматология.ПолучитьВремяРаботыСтруктурнойЕдиницы(ДатаСобытия, Объект.СтруктурнаяЕдиница));
	СписокВремени = РаботаСДиалогами.ВернутьСписокВремени(МассивПериодов, Истина);
	
	Для Каждого ИмяЭлемента Из МассивИнициализируемыхЭлементов Цикл
		
		Элементы[ИмяЭлемента].СписокВыбора.Очистить();
		Для Каждого ПредставлениеВремени Из СписокВремени Цикл
			Элементы[ИмяЭлемента].СписокВыбора.Добавить(ПредставлениеВремени.Значение, ПредставлениеВремени.Представление);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ПроинициализироватьЭлементыВыбораВремени()

#КонецОбласти
